list_of_dicts = [
    {
        'Барнаул': 4,
        'Владивосток': 3,
        'Волгоград': 2,
        'Нижний Новгород': 8,
        'Санкт-Петербург': 4,
        'Ульяновск': 8,
        'Уфа': 7,
        'Хабаровск': 2,
        'Ярославль': 1
    },
    {
        'Владивосток': 3,
        'Воронеж': 4,
        'Казань': 2,
        'Москва': 8,
        'Новокузнецк': 3,
        'Новосибирск': 4,
        'Омск': 1,
        'Пермь': 2,
        'Тольятти': 1,
        'Уфа': 3
    },
    {
        'Барнаул': 1,
        'Владивосток': 1,
        'Волгоград': 9,
        'Москва': 1,
        'Новосибирск': 6,
        'Санкт-Петербург': 3,
        'Ульяновск': 9
    },
    {
        'Владивосток': 1,
        'Воронеж': 3,
        'Екатеринбург': 6,
        'Оренбург': 3,
        'Санкт-Петербург': 8,
        'Тольятти': 2
    }
]
# ПЕРЕИМЕНОВАТЬ: множество (матем.) — set
# Замечания исправлены______________________________________________________________________________
Set = set()
for i in range(len(list_of_dicts)):
    Set = Set | set(list_of_dicts[i])
# ИСПОЛЬЗОВАТЬ везде: PEP 8 не рекомендует добавлять пробелы вокруг = при передаче аргументов по ключу
# ?????___Это замечание не понял__?????____________________________________________________________
Set_key = dict.fromkeys(sorted(Set, reverse=False), set())

# ПЕРЕИМЕНОВАТЬ: города — cities; словарь (python) — dict; словарь городов — cities_dict
# Замечания исправлены______________________________________________________________________________
for cities in list_of_dicts:
    # ПЕРЕИМЕНОВАТЬ: город — city
    # Замечания исправлены______________________________________________________________________________
    for city, val in Set_key.items():
        try:
            if cities[city]:
                try:
                    Set_key[city] = Set_key[city] | {str(cities[city])}
                except KeyError:
                    Set_key[city]
        except KeyError:
            Set_key[city]
            
for k, v in Set_key.items():
    print(f'{k}: {v}')


# Барнаул: {'1', '4'}
# Владивосток: {'3', '1'}
# Волгоград: {'2', '9'}
# Воронеж: {'3', '4'}
# Екатеринбург: {'6'}
# Казань: {'2'}
# Москва: {'8', '1'}
# Нижний Новгород: {'8'}
# Новокузнецк: {'3'}
# Новосибирск: {'6', '4'}
# Омск: {'1'}
# Оренбург: {'3'}
# Пермь: {'2'}
# Санкт-Петербург: {'8', '3', '4'}
# Тольятти: {'1', '2'}
# Ульяновск: {'8', '9'}
# Уфа: {'3', '7'}
# Хабаровск: {'2'}
# Ярославль: {'1'}

