# ПЕРЕИМЕНОВАТЬ везде: в Python для имён переменных используется змеиный_нижний_регистр или слитныйнижнийрегистр, для имён классов используется ВерблюжийРегистр, для имён условных констант используется ЗМЕИНЫЙ_ВЕРХНИЙ_РЕГИСТР или СЛИТНЫЙВЕРХНИЙРЕГИСТР
Name = input(' введите имя: ')
Surname = input(' введите фамилию: ')
Age = input(' введите возраст: ')
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (см. комментарий к тесту)
print(Name, Surname, ',', Age)


# введите имя: Иннокентий
# введите фамилию: Максимов
# введите возраст: 29
# КОММЕНТАРИЙ: лишний пробел перед запятой
# Иннокентий Максимов , 29

# КОММЕНТАРИЙ: во всех задачах, связанных с генерацией строк по некоему требованию, вам необходимо сравнивать получившуюся строку с приведённой в примере


# ИТОГ: хорошо, немного доработать — 3/4
