Number_1 = int(input(' введите число: '))
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (лишние пробелы, неверный регистр)
print('Следующее за числом ', Number_1, ' число: ', Number_1 + 1, '\nдля числа ', Number_1,'предыдущее число: ', Number_1 - 1)

# введите число: 20
# ИСПОЛЬЗОВАТЬ везде: PEP 8 рекомендует добавлять пробелы после символа # — в большинстве редакторов кода, включая Notepad++, это делает команда "Вкл./Выкл. комментарий"
# Следующее за числом  20  число:  21
# для числа  20 предыдущее число:  19

# КОММЕНТАРИЙ: в случае, если вы будете генерировать строку не для чтения человеком, а для другой функции/класса/программы — неверный формат может стоить вам неработающего приложения


# ИТОГ: можно лучше — 2/3
