Number_three = input('введите трехзначное число: ')
# УДАЛИТЬ: в условии задач сказано найти решение, используя только уже полученный материал — сделайте это
x, y, z = list(Number_three)
sum_Numbers = int(x) + int(y) + int(z)
comp_Numbers = int(x) * int(y) * int(z)
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (лишние пробелы)
print('Сумма цыфр = ', sum_Numbers, '\nПроизведение цифр = ', comp_Numbers)


# введите трехзначное число: 333
# Сумма цыфр =  9
# Произведение цифр =  27


# ИТОГ: переделать — 1/4
